Revit 2027 API
EnergyAnalysisDetailModelOptions Properties
The EnergyAnalysisDetailModelOptions type exposes the following members.
Properties
Name | Description
EnergyModelType | Obsolete.
 It indicates whether the energy model is based on rooms/spaces or building elements.
ExportMullions |  Indicates if to specify the setting for exporting mullions.
IncludeShadingSurfaces |  Indicates if to set and get the setting for if shading surfaces should be included.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SimplifyCurtainSystems |  Indicates if to specify the setting for simplified curtain systems.
Tier |  Level of computation for energy analysis model.
Top
See Also
Reference
EnergyAnalysisDetailModelOptions Class
Autodesk.Revit.DB.Analysis Namespace